public/School/Classes/AdvBusMgmt/Chapter 1 Test Notes.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Chapter 1 Test Notes</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<h1 class="title">Chapter 1 Test Notes</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0216819">Key Terms</a></li>
</ul>
</div>
</div>
<div id="outline-container-org0216819" class="outline-2">
<h2 id="org0216819">Key Terms</h2>
<div class="outline-text-2" id="text-org0216819">
</div>
<ul class="org-ul">
<li><a id="org5d9ef9e"></a>Management: the proccess of accomplishing the goals of an organization through the effective use of people and other resources<br /></li>
<li><a id="org9919681"></a>Planning: involves analyzing information and making decisions about what needs to be done<br /></li>
<li><a id="orge5fc1b2"></a>Organizing: is concerned with determining how plans can be accomplished most effectively and arranging resources to complete work<br /></li>
<li><a id="orgbcf2a86"></a>Staffing: focuses on finidng indiviudlas with the right skills to do the work<br /></li>
<li><a id="org6e0a1f4"></a>Leading: requires working with employees to ensure they are motivated and have the resources needed to help carry out plans and get the work done<br /></li>
<li><a id="org5bf7939"></a>Controlling: involves evaluating results to determine if the company's objectives have been accomplished as planned<br /></li>
<li><a id="org982041a"></a>Manager: completes all five management functions on a regular basis and has authority over jobs and people<br /></li>
<li><a id="org45bf27c"></a>Supervisor: a manager whose main job is to direct the work of employees. They are the first level of management in a company<br /></li>
<li><a id="org96fc995"></a>Executive: a top-level manager who spends almost all of his or her time on managmenet functions and decisions that affect the entire company<br /></li>
<li><a id="org5121835"></a>Middle-Manager: completes all of the management functions, but spends most of the time completing specialized work in one management function or is responsible for a specefic part of the companys operations<br /></li>
<li><a id="org51f1691"></a>Industrial Revolution: the era of the 18th and 19th century in which machine power replaced human and animal power in the production process, leading to major business and social changes<br /></li>
<li><a id="orgf07b826"></a>Management Science: the careful, objective study of management decisions and procedures in order to improve the operation of busineses and organizations<br /></li>
<li><a id="org2132841"></a>Classical Management: studies the way work is organized and the procedures used to complete a job in order to increase worker productivity. Fredrick Taylor<br /></li>
<li><a id="org19e3b22"></a>Administrative Management: identifies the most effective practices for organizing and managing a business. Henri Fayol<br /></li>
<li><a id="org12f2848"></a>Behavioral Management: directed at organizational improvement through understanding employee motivation and behavior. Also called Human relations management. Douglas Mcgregor and Elton Mayo<br /></li>
<li><a id="org75594e6"></a>Quality Management: a total commitment by everyone in a organiztion to improve the quality of procedures and products by reducing waste, errors, and defects. Japan hired american engineer W. Edward Deming<br /></li>
<li><a id="org932841a"></a>Business Competition: the rivarly among companies for consumers<br /></li>
<li><a id="org6b9d99f"></a>Management Strategy: a carefully developed overall approach to leading an organization<br />
<ul class="org-ul">
<li><a id="orgbe15025"></a>The business<br /></li>
<li><a id="org6f6afc6"></a>The work<br /></li>
<li><a id="orgdf9d6f8"></a>The management<br /></li>
<li><a id="orgafb6553"></a>The Business Enviorment<br /></li>
</ul>
</li>
<li><a id="orgb78a79f"></a>Workforce: becoming more diverse between 2010 and 2050<br /></li>
<li><a id="org0675882"></a>Administrative management characteristics:<br />
<ul class="org-ul">
<li><a id="org3b4077d"></a>Authority and responsibility: managers have the authority to assign tasks and delegate responsibilities<br /></li>
<li><a id="org85b5463"></a>Unity of command: each employee must recieve direction from only one manager to avoid conflicts and help keep a chain of command<br /></li>
<li><a id="org4f9dbe7"></a>Unity of purpose: the goals and direction of an organization must be clear and supported by everyone<br /></li>
<li><a id="org473b87f"></a>Adequte compensation: the wages and benefits for every employee should be fair and satisfactory to both the individual and their organization<br /></li>
<li><a id="orgce60da0"></a>Espirit de corps: organizations should work to build good interpersonal relationships, a sense of teamwork and harmony<br /></li>
</ul>
</li>
</ul>
</div>
</div>
</body>
</html>
